In [62]:
import sqlite3
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

In [29]:
# dbase = sqlite3.connect('Our_data.db')

In [30]:
# def insert_record(ID, NAME, DIVISION, STARS):
#     dbase.execute('''INSERT INTO employee_records VALUES (?,?,?,?)''', (ID, NAME, DIVISION, STARS))
#     dbase.commit()
# def read_data(table):
#     # can use dbase.execute but cursor is faster
#     cursor = dbase.cursor()
#     val = cursor.execute('''SELECT * FROM ''' + str(table))
#     x = val.fetchall()
# #     print(x)
#     for i in x:
#         print(i)
# #     for i in val:
# #         print("\n\nID \t\t: " + str(i[0]))
# #         print("Name \t\t: " + str(i[1]))
# #         print("Division \t: " + str(i[2]))
# #         print("Star \t\t: " + str(i[3]))
    
# #     for i in x:
# #         print("\n\nID \t\t: " + str(i[0]))
# #         print("Name \t\t: " + str(i[1]))
# #         print("Division \t: " + str(i[2]))
# #         print("Star \t\t: " + str(i[3]))

In [31]:
# dbase.execute('''CREATE TABLE IF NOT EXISTS employee_records (
#     ID INT PRIMARY KEY NOT NULL ,
#     Name TEXT NOT NULL ,
#     Division TEXT NOT NULL,
#     Star INT NOT NULL
# )''')

In [32]:
# insert_record(2, 'Karan', 'Mechanical', 4)

In [56]:
# insert_record(1, 'Aman', 'IT', 4)

In [58]:
# read_data('employee_records')

In [59]:
# dbase.close()

## Reading a csv file and inserting it into db

In [15]:
# data = pd.read_csv("train.csv")

In [14]:
# data.columns

In [13]:
# data.head()

In [12]:
# dbase.execute('''DROP table titanic''')

In [11]:
# dbase.execute('''CREATE TABLE IF NOT EXISTS titanic (
#     PassengerId INT PRIMARY KEY NOT NULL ,
#     Survived INT ,
#     Pclass INT,
#     Name TEXT ,
#     Sex TEXT ,
#     Age FLOAT,
#     SibSp INT, 
#     Parch INT,
#     Ticket TEXT ,
#     Fare FLOAT,
#     Cabin TEXT  ,
#     Embarked TEXT 
# )''')

In [68]:
# data.to_sql('titanic', dbase, if_exists='append', index=False)

In [69]:
# dbase.execute('''select * from titanic''')

In [70]:
# import csv
# cur = dbase.cursor()

In [71]:
# rows = csv.reader(data)

In [72]:
# rows

In [73]:
# cur.executemany("INSERT INTO titanic VALUES (?,?,?,?,?,?,?,?,?,?,?,?)", [rows] )

In [74]:
# cur.execute("SELECT * FROM titanic")
# print(cur.fetchall())

In [75]:
# read_data('titanic')

In [45]:
# import csv
# cur = dbase.cursor()
# rows = csv.reader(data)
# cur.executemany("INSERT INTO titanic VALUES (?,?,?,?,?,?,?,?,?,?,?,?)", [rows] )
# cur.execute("SELECT * FROM titanic")
# print(cur.fetchall())

## HELPER FUNCTION

In [8]:
def insert_record(table_name, values):
#     d = [(1,'Aman','8586096103', 'aman.r1298@gmail.com', 'aman'),(2, 'Karan', '1234567890', 'karan12@gmail.com', 'kiru')]
    if(table_name == 'retailer_data'):
        d = []
        for val in values:
            d.append((val))
    #     d = [(1),('Aman'),('8586096103'), ('aman.r1298@gmail.com'), ('aman')]

        print(d)

        dbase.executemany('''INSERT INTO ''' +str(table_name) + '''(r_name, r_ph_no, r_login_id, r_password) VALUES (?,?,?,?)''', d )
    #     dbase.execute('''INSERT INTO employee_records VALUES (?,?,?,?)''', (ID, NAME, DIVISION, STARS))
        dbase.commit()
    elif(table_name == 'customer_data'):
        d = []
        for val in values:
            d.append((val))
        print(d)
        dbase.executemany('''INSERT INTO ''' +str(table_name) + '''(c_name, c_ph_no, c_login_id, c_password) VALUES (?,?,?,?)''', d )
        dbase.commit()

# database schema

In [63]:
dbase = sqlite3.connect('new_data.db')

## retailerData

In [10]:
dbase.execute('''create table if not exists retailer_data(
r_id integer primary key,
r_name  TEXT NOT_NULL,
r_ph_no TEXT,
r_login_id TEXT,
r_password TEXT
) ''')

In [11]:
#inserting values
l = [ ('aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'),('karan', '1234567890', 'karan@gmail.com', 'kiru1298'), ('Rohan', '9876543210', 'rohan@gmail.com', 'rohan123') ]
insert_record('retailer_data',l)
# l = [ 'karan', '1234567890', 'karan@gmail.com', 'kiru1298']
# insert_record('retailer_data', l)

[('aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'), ('karan', '1234567890', 'karan@gmail.com', 'kiru1298'), ('Rohan', '9876543210', 'rohan@gmail.com', 'rohan123')]

### view table

In [12]:
cur = dbase.cursor()
cur.execute('''select * from retailer_data''')
print(cur)
print(cur.fetchall())

<sqlite3.Cursor object at 0x7f445ba9d500>
[(1, 'aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'), (2, 'karan', '1234567890', 'karan@gmail.com', 'kiru1298'), (3, 'Rohan', '9876543210', 'rohan@gmail.com', 'rohan123')]

### For each retailer

### info_id_r_id

In [13]:
dbase.execute('''create table if not exists info_1(
product_id integer primary key,
product_name  TEXT NOT_NULL,
product_quantity INT,
product_cp FlOAT,
product_sp FLOAT
) ''')

In [ ]:
dbase.execute('''''')

### sales_id_r_id

In [14]:
dbase.execute('''create table if not exists sales_1 (
dt datetime default current_timestamp,
sales FLOAT
);''')

In [29]:
dbase.execute('''drop table sales_1''')

### transaction_id_r_id

In [3]:
# dbase.execute('''create table if not exists transactions_1(
# invoice_no NOT_NULL TEXT,
# description  TEXT,
# quantity int,
# invoice_date datetime default current_timestamp,
# price FLOAT,
# c_id  INT
# ); ''')

In [4]:
# dbase.execute('''create table if not exists transactions_1(
# invoice_no ,
# description ,
# quantity ,
# invoice_date ,
# price ,
# c_id
# ); ''')
# dbase.commit()

# Entering transactions

In [126]:
# import csv
# cur = dbase.cursor()
data  = pd.read_csv('../../Apriori/onlineretail_clean.csv')
data2 = pd.read_csv('../../Apriori/onlineretail2_clean.csv')

In [127]:
data['InvoiceDate'] = pd.to_datetime(data['InvoiceDate'])
data2['InvoiceDate'] = pd.to_datetime(data2['InvoiceDate'])

In [112]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406829 entries, 0 to 406828
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      406829 non-null  object
 1   StockCode    406829 non-null  object
 2   Description  406829 non-null  object
 3   Quantity     406829 non-null  int64
 4   InvoiceDate  406829 non-null  datetime64[ns]
 5   Price        406829 non-null  float64
 6   Customer ID  406829 non-null  float64
 7   Country      406829 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 24.8+ MB

In [113]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 824348 entries, 0 to 824347
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      824348 non-null  object
 1   StockCode    824348 non-null  object
 2   Description  824348 non-null  object
 3   Quantity     824348 non-null  int64
 4   InvoiceDate  824348 non-null  datetime64[ns]
 5   Price        824348 non-null  float64
 6   Customer ID  824348 non-null  float64
 7   Country      824348 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 50.3+ MB

In [114]:
data.to_csv('onlineretail_clean.csv')
data2.to_csv('onlineretail2_clean.csv')

In [96]:
data.to_sql("transactions_1", dbase)
data2.to_sql("transactions_2", dbase)

ValueError: Table 'transactions_2' already exists.

In [59]:
d = pd.read_csv('../../Apriori/onlineretail_clean.csv')

In [61]:
d.to_sql('unfor',dbase)
d['InvoiceDate'] = pd.to_datetime(d["InvoiceDate"])
d.to_sql('form', dbase)

In [15]:
len(data)`

541909

In [8]:
len(data)train.csv

541909

In [16]:
# z = 0 
# for i in rows:
#     if( z == 10):
#         break
#     print(i)
#     z = z+1

# INSERTING DATA FROM CSV TO DB

b'/home/aman/Desktop/Minor_project/database/create_manage'

In [89]:
data = pd.read_csv('../../Apriori/onlineretail2_clean.csv')

In [90]:
data.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [91]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 824348 entries, 0 to 824347
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      824348 non-null  object
 1   StockCode    824348 non-null  object
 2   Description  824348 non-null  object
 3   Quantity     824348 non-null  int64
 4   InvoiceDate  824348 non-null  object
 5   Price        824348 non-null  float64
 6   Customer ID  824348 non-null  float64
 7   Country      824348 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 50.3+ MB

In [92]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 824348 entries, 0 to 824347
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      824348 non-null  object
 1   StockCode    824348 non-null  object
 2   Description  824348 non-null  object
 3   Quantity     824348 non-null  int64
 4   InvoiceDate  824348 non-null  object
 5   Price        824348 non-null  float64
 6   Customer ID  824348 non-null  float64
 7   Country      824348 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 50.3+ MB

In [36]:
len(data['StockCode'].unique())

4644

In [37]:
len(data['Description'].unique())

5298

In [21]:
dbase.execute('''drop table transactions_1''')

In [38]:
data.to_sql('transactions_2', dbase)

In [42]:
# rows = csv.reader(data)
# cur.executemany("INSERT INTO transactions_1 values (?,?,?,?,?,?)", [rows] )
# cur.execute("SELECT * FROM transactions_1")
# print(cur.fetchall())

In [14]:
cur = dbase.cursor()
cur.execute('''select * from transactions_1''')
# print(cur)
print(cur.fetchall())

7, '581571', '22227', 'HANGING HEART MIRROR DECORATION ', 10, '2011-12-09 12:00:00', 0.65, 15311.0, 'United Kingdom'), (406658, '581571', '22794', 'SWEETHEART WIRE MAGAZINE RACK', 1, '2011-12-09 12:00:00', 7.95, 15311.0, 'United Kingdom'), (406659, '581571', '23182', 'TOILET SIGN OCCUPIED OR VACANT', 1, '2011-12-09 12:00:00', 0.83, 15311.0, 'United Kingdom'), (406660, '581571', '21755', 'LOVE BUILDING BLOCK WORD', 1, '2011-12-09 12:00:00', 6.25, 15311.0, 'United Kingdom'), (406661, '581571', '85053', 'FRENCH ENAMEL CANDLEHOLDER', 2, '2011-12-09 12:00:00', 2.1, 15311.0, 'United Kingdom'), (406662, '581571', '23110', 'PARISIENNE KEY CABINET ', 2, '2011-12-09 12:00:00', 5.75, 15311.0, 'United Kingdom'), (406663, '581571', '21169', "YOU'RE CONFUSING ME METAL SIGN ", 1, '2011-12-09 12:00:00', 1.69, 15311.0, 'United Kingdom'), (406664, '581571', '21258', 'VICTORIAN SEWING BOX LARGE', 8, '2011-12-09 12:00:00', 10.95, 15311.0, 'United Kingdom'), (406665, '581571', '23168', 'CLASSIC CAFE SUGAR DISPENSER', 36, '2011-12-09 12:00:00', 1.04, 15311.0, 'United Kingdom'), (406666, '581571', '23167', 'SMALL CERAMIC TOP STORAGE JAR ', 96, '2011-12-09 12:00:00', 0.69, 15311.0, 'United Kingdom'), (406667, '581571', '21314', 'SMALL GLASS HEART TRINKET POT', 48, '2011-12-09 12:00:00', 1.85, 15311.0, 'United Kingdom'), (406668, '581571', '21137', 'BLACK RECORD COVER FRAME', 24, '2011-12-09 12:00:00', 3.39, 15311.0, 'United Kingdom'), (406669, '581571', '44234', 'ASSORTED CIRCULAR MOBILE', 1, '2011-12-09 12:00:00', 0.21, 15311.0, 'United Kingdom'), (406670, '581571', '84347', 'ROTATING SILVER ANGELS T-LIGHT HLDR', 24, '2011-12-09 12:00:00', 2.55, 15311.0, 'United Kingdom'), (406671, '581572', '23328', 'SET 6 SCHOOL MILK BOTTLES IN CRATE', 48, '2011-12-09 12:08:00', 3.39, 16705.0, 'United Kingdom'), (406672, '581572', '22627', 'MINT KITCHEN SCALES', 4, '2011-12-09 12:08:00', 8.5, 16705.0, 'United Kingdom'), (406673, '581572', '22624', 'IVORY KITCHEN SCALES', 4, '2011-12-09 12:08:00', 8.5, 16705.0, 'United Kingdom'), (406674, '581572', '23245', 'SET OF 3 REGENCY CAKE TINS', 4, '2011-12-09 12:08:00', 4.95, 16705.0, 'United Kingdom'), (406675, '581574', '22326', 'ROUND SNACK BOXES SET OF4 WOODLAND ', 6, '2011-12-09 12:09:00', 2.95, 12526.0, 'Germany'), (406676, '581574', '22328', 'ROUND SNACK BOXES SET OF 4 FRUITS ', 6, '2011-12-09 12:09:00', 2.95, 12526.0, 'Germany'), (406677, '581574', '23199', 'JUMBO BAG APPLES', 10, '2011-12-09 12:09:00', 2.08, 12526.0, 'Germany'), (406678, '581574', '23581', 'JUMBO BAG PAISLEY PARK', 10, '2011-12-09 12:09:00', 2.08, 12526.0, 'Germany'), (406679, '581574', '23238', 'SET OF 4 KNICK KNACK TINS LONDON ', 6, '2011-12-09 12:09:00', 4.15, 12526.0, 'Germany'), (406680, '581574', '23237', 'SET OF 4 KNICK KNACK TINS LEAF', 6, '2011-12-09 12:09:00', 4.15, 12526.0, 'Germany'), (406681, '581574', '21257', 'VICTORIAN SEWING BOX MEDIUM', 2, '2011-12-09 12:09:00', 7.95, 12526.0, 'Germany'), (406682, '581574', '21258', 'VICTORIAN SEWING BOX LARGE', 2, '2011-12-09 12:09:00', 12.75, 12526.0, 'Germany'), (406683, '581574', '23111', 'PARISIENNE SEWING BOX', 2, '2011-12-09 12:09:00', 12.5, 12526.0, 'Germany'), (406684, '581574', '22077', '6 RIBBONS RUSTIC CHARM', 12, '2011-12-09 12:09:00', 1.95, 12526.0, 'Germany'), (406685, '581574', '22074', '6 RIBBONS SHIMMERING PINKS ', 12, '2011-12-09 12:09:00', 0.39, 12526.0, 'Germany'), (406686, '581574', '22621', 'TRADITIONAL KNITTING NANCY', 12, '2011-12-09 12:09:00', 1.65, 12526.0, 'Germany'), (406687, '581574', 'POST', 'POSTAGE', 2, '2011-12-09 12:09:00', 18.0, 12526.0, 'Germany'), (406688, '581578', 'POST', 'POSTAGE', 3, '2011-12-09 12:16:00', 18.0, 12713.0, 'Germany'), (406689, '581578', '21124', 'SET/10 BLUE POLKADOT PARTY CANDLES', 24, '2011-12-09 12:16:00', 1.25, 12713.0, 'Germany'), (406690, '581578', '21122', 'SET/10 PINK POLKADOT PARTY CANDLES', 24, '2011-12-09 12:16:00', 1.25, 12713.0, 'Germany'), (406691, '581578', '21121', 'SET/10 RED POLKADOT PARTY CANDLES', 24, '2011-12-09 12:16:00', 1.25, 12713.0, 'Germany'), (406692, '581578', '23389', 'SPACEBOY MINI BACKPACK', 4, '2011-12-09 12:16:00', 4.15, 12713.0, 'Germany'), (406693, '581578', '22556', 'PLASTERS IN TIN CIRCUS PARADE ', 12, '2011-12-09 12:16:00', 1.65, 12713.0, 'Germany'), (406694, '581578', '22976', 'CIRCUS PARADE CHILDRENS EGG CUP ', 12, '2011-12-09 12:16:00', 1.25, 12713.0, 'Germany'), (406695, '581578', '23255', 'CHILDRENS CUTLERY CIRCUS PARADE', 12, '2011-12-09 12:16:00', 4.15, 12713.0, 'Germany'), (406696, '581578', '84997D', 'CHILDRENS CUTLERY POLKADOT PINK', 8, '2011-12-09 12:16:00', 4.15, 12713.0, 'Germany'), (406697, '581578', '84997B', 'CHILDRENS CUTLERY RETROSPOT RED ', 8, '2011-12-09 12:16:00', 4.15, 12713.0, 'Germany'), (406698, '581578', '84997C', 'CHILDRENS CUTLERY POLKADOT BLUE', 8, '2011-12-09 12:16:00', 4.15, 12713.0, 'Germany'), (406699, '581578', '22555', 'PLASTERS IN TIN STRONGMAN', 12, '2011-12-09 12:16:00', 1.65, 12713.0, 'Germany'), (406700, '581578', '21914', 'BLUE HARMONICA IN BOX ', 12, '2011-12-09 12:16:00', 1.25, 12713.0, 'Germany'), (406701, '581578', '22549', 'PICTURE DOMINOES', 24, '2011-12-09 12:16:00', 1.45, 12713.0, 'Germany'), (406702, '581578', '21918', 'SET 12 KIDS COLOUR  CHALK STICKS', 24, '2011-12-09 12:16:00', 0.42, 12713.0, 'Germany'), (406703, '581578', '22992', 'REVOLVER WOODEN RULER ', 12, '2011-12-09 12:16:00', 1.95, 12713.0, 'Germany'), (406704, '581578', '22991', 'GIRAFFE WOODEN RULER', 12, '2011-12-09 12:16:00', 1.95, 12713.0, 'Germany'), (406705, '581578', '23229', 'VINTAGE DONKEY TAIL GAME ', 6, '2011-12-09 12:16:00', 3.75, 12713.0, 'Germany'), (406706, '581578', '22622', 'BOX OF VINTAGE ALPHABET BLOCKS', 6, '2011-12-09 12:16:00', 11.95, 12713.0, 'Germany'), (406707, '581578', '21506', 'FANCY FONT BIRTHDAY CARD, ', 12, '2011-12-09 12:16:00', 0.42, 12713.0, 'Germany'), (406708, '581578', '21507', 'ELEPHANT BIRTHDAY CARD ', 12, '2011-12-09 12:16:00', 0.42, 12713.0, 'Germany'), (406709, '581578', '23037', 'CANDLE HOLDER SILVER MADELINE', 12, '2011-12-09 12:16:00', 1.65, 12713.0, 'Germany'), (406710, '581578', '23550', 'WRAP ALPHABET POSTER  ', 25, '2011-12-09 12:16:00', 0.42, 12713.0, 'Germany'), (406711, '581578', '22711', 'WRAP CIRCUS PARADE', 25, '2011-12-09 12:16:00', 0.42, 12713.0, 'Germany'), (406712, '581578', '21497', 'FANCY FONTS BIRTHDAY WRAP', 25, '2011-12-09 12:16:00', 0.42, 12713.0, 'Germany'), (406713, '581578', '22704', 'WRAP RED APPLES ', 25, '2011-12-09 12:16:00', 0.42, 12713.0, 'Germany'), (406714, '581578', '22585', 'PACK OF 6 BIRDY GIFT TAGS', 12, '2011-12-09 12:16:00', 1.25, 12713.0, 'Germany'), (406715, '581578', '23205', 'CHARLOTTE BAG VINTAGE ALPHABET ', 10, '2011-12-09 12:16:00', 0.85, 12713.0, 'Germany'), (406716, '581578', '23201', 'JUMBO BAG ALPHABET', 10, '2011-12-09 12:16:00', 2.08, 12713.0, 'Germany'), (406717, '581578', '23515', 'EMBROIDERED RIBBON REEL DAISY ', 6, '2011-12-09 12:16:00', 2.08, 12713.0, 'Germany'), (406718, '581578', '22081', 'RIBBON REEL FLORA + FAUNA ', 10, '2011-12-09 12:16:00', 1.65, 12713.0, 'Germany'), (406719, '581578', '22080', 'RIBBON REEL POLKADOTS ', 10, '2011-12-09 12:16:00', 1.65, 12713.0, 'Germany'), (406720, '581578', '23298', 'SPOTTY BUNTING', 9, '2011-12-09 12:16:00', 4.95, 12713.0, 'Germany'), (406721, '581578', '22993', 'SET OF 4 PANTRY JELLY MOULDS', 12, '2011-12-09 12:16:00', 1.25, 12713.0, 'Germany'), (406722, '581578', '22907', 'PACK OF 20 NAPKINS PANTRY DESIGN', 12, '2011-12-09 12:16:00', 0.85, 12713.0, 'Germany'), (406723, '581578', '22908', 'PACK OF 20 NAPKINS RED APPLES', 12, '2011-12-09 12:16:00', 0.85, 12713.0, 'Germany'), (406724, '581578', '23215', 'JINGLE BELL HEART ANTIQUE SILVER', 12, '2011-12-09 12:16:00', 2.08, 12713.0, 'Germany'), (406725, '581578', '22736', 'RIBBON REEL MAKING SNOWMEN ', 10, '2011-12-09 12:16:00', 1.65, 12713.0, 'Germany'), (406726, '581579', '22386', 'JUMBO BAG PINK POLKADOT', 10, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406727, '581579', '22411', 'JUMBO SHOPPER VINTAGE RED PAISLEY', 10, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406728, '581579', '21929', 'JUMBO BAG PINK VINTAGE PAISLEY', 10, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406729, '581579', '85099C', 'JUMBO  BAG BAROQUE BLACK WHITE', 10, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406730, '581579', '20713', 'JUMBO BAG OWLS', 10, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406731, '581579', '21931', 'JUMBO STORAGE BAG SUKI', 10, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406732, '581579', '23199', 'JUMBO BAG APPLES', 30, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406733, '581579', '23353', '6 GIFT TAGS VINTAGE CHRISTMAS ', 12, '2011-12-09 12:19:00', 0.83, 17581.0, 'United Kingdom'), (406734, '581579', '23350', 'ROLL WRAP VINTAGE SPOT ', 25, '2011-12-09 12:19:00', 1.25, 17581.0, 'United Kingdom'), (406735, '581579', '23319', "BOX OF 6 MINI 50'S CRACKERS", 12, '2011-12-09 12:19:00', 2.49, 17581.0, 'United Kingdom'), (406736, '581579', '23318', 'BOX OF 6 MINI VINTAGE CRACKERS', 12, '2011-12-09 12:19:00', 2.49, 17581.0, 'United Kingdom'), (406737, '581579', '22910', 'PAPER CHAIN KIT VINTAGE CHRISTMAS', 12, '2011-12-09 12:19:00', 2.95, 17581.0, 'United Kingdom'), (406738, '581579', '22086', "PAPER CHAIN KIT 50'S CHRISTMAS ", 12, '2011-12-09 12:19:00', 2.95, 17581.0, 'United Kingdom'), (406739, '581579', '21121', 'SET/10 RED POLKADOT PARTY CANDLES', 24, '2011-12-09 12:19:00', 1.25, 17581.0, 'United Kingdom'), (406740, '581579', '23489', 'VINTAGE BELLS GARLAND', 6, '2011-12-09 12:19:00', 2.89, 17581.0, 'United Kingdom'), (406741, '581579', '23570', 'TRADITIONAL PICK UP STICKS GAME ', 12, '2011-12-09 12:19:00', 1.25, 17581.0, 'United Kingdom'), (406742, '581579', '22993', 'SET OF 4 PANTRY JELLY MOULDS', 12, '2011-12-09 12:19:00', 1.25, 17581.0, 'United Kingdom'), (406743, '581579', '23480', 'MINI LIGHTS WOODLAND MUSHROOMS', 8, '2011-12-09 12:19:00', 3.75, 17581.0, 'United Kingdom'), (406744, '581579', '23084', 'RABBIT NIGHT LIGHT', 24, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406745, '581579', '22197', 'POPCORN HOLDER', 24, '2011-12-09 12:19:00', 0.85, 17581.0, 'United Kingdom'), (406746, '581579', '23293', 'SET OF 12 FAIRY CAKE BAKING CASES', 8, '2011-12-09 12:19:00', 0.83, 17581.0, 'United Kingdom'), (406747, '581579', '23313', 'VINTAGE CHRISTMAS BUNTING', 15, '2011-12-09 12:19:00', 4.95, 17581.0, 'United Kingdom'), (406748, '581579', '84347', 'ROTATING SILVER ANGELS T-LIGHT HLDR', 24, '2011-12-09 12:19:00', 2.55, 17581.0, 'United Kingdom'), (406749, '581579', '22083', 'PAPER CHAIN KIT RETROSPOT', 6, '2011-12-09 12:19:00', 2.95, 17581.0, 'United Kingdom'), (406750, '581579', '23376', 'PACK OF 12 VINTAGE CHRISTMAS TISSUE', 24, '2011-12-09 12:19:00', 0.39, 17581.0, 'United Kingdom'), (406751, '581579', '22941', 'CHRISTMAS LIGHTS 10 REINDEER', 4, '2011-12-09 12:19:00', 8.5, 17581.0, 'United Kingdom'), (406752, '581579', '23201', 'JUMBO BAG ALPHABET', 20, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406753, '581579', '23343', 'JUMBO BAG VINTAGE CHRISTMAS ', 30, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406754, '581579', '23344', "JUMBO BAG 50'S CHRISTMAS ", 20, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406755, '581579', '23581', 'JUMBO BAG PAISLEY PARK', 40, '2011-12-09 12:19:00', 1.79, 17581.0, 'United Kingdom'), (406756, '581580', '23334', 'IVORY WICKER HEART SMALL', 4, '2011-12-09 12:20:00', 0.63, 12748.0, 'United Kingdom'), (406757, '581580', '21790', 'VINTAGE SNAP CARDS', 1, '2011-12-09 12:20:00', 0.85, 12748.0, 'United Kingdom'), (406758, '581580', '84993A', '75 GREEN PETIT FOUR CASES', 2, '2011-12-09 12:20:00', 0.42, 12748.0, 'United Kingdom'), (406759, '581580', '22906', '12 MESSAGE CARDS WITH ENVELOPES', 1, '2011-12-09 12:20:00', 1.65, 12748.0, 'United Kingdom'), (406760, '581580', '21803', 'CHRISTMAS TREE STAR DECORATION', 2, '2011-12-09 12:20:00', 0.42, 12748.0, 'United Kingdom'), (406761, '581580', '21809', 'CHRISTMAS HANGING TREE WITH BELL', 2, '2011-12-09 12:20:00', 0.39, 12748.0, 'United Kingdom'), (406762, '581580', '20974', '12 PENCILS SMALL TUBE SKULL', 1, '2011-12-09 12:20:00', 0.65, 12748.0, 'United Kingdom'), (406763, '581580', '23338', 'EGG FRYING PAN RED ', 1, '2011-12-09 12:20:00', 2.08, 12748.0, 'United Kingdom'), (406764, '581580', '85049A', 'TRADITIONAL CHRISTMAS RIBBONS', 1, '2011-12-09 12:20:00', 1.25, 12748.0, 'United Kingdom'), (406765, '581580', '23126', 'FELTCRAFT GIRL AMELIE KIT', 1, '2011-12-09 12:20:00', 4.95, 12748.0, 'United Kingdom'), (406766, '581580', '22695', 'WICKER WREATH SMALL', 1, '2011-12-09 12:20:00', 0.59, 12748.0, 'United Kingdom'), (406767, '581580', '22144', 'CHRISTMAS CRAFT LITTLE FRIENDS', 1, '2011-12-09 12:20:00', 2.1, 12748.0, 'United Kingdom'), (406768, '581580', '22908', 'PACK OF 20 NAPKINS RED APPLES', 2, '2011-12-09 12:20:00', 0.85, 12748.0, 'United Kingdom'), (406769, '581580', '22894', 'TABLECLOTH RED APPLES DESIGN ', 2, '2011-12-09 12:20:00', 9.95, 12748.0, 'United Kingdom'), (406770, '581580', '22704', 'WRAP RED APPLES ', 25, '2011-12-09 12:20:00', 0.42, 12748.0, 'United Kingdom'), (406771, '581580', '22721', 'SET OF 3 CAKE TINS SKETCHBOOK', 1, '2011-12-09 12:20:00', 1.95, 12748.0, 'United Kingdom'), (406772, '581580', '22816', 'CARD MOTORBIKE SANTA', 24, '2011-12-09 12:20:00', 0.42, 12748.0, 'United Kingdom'), (406773, '581580', '85049E', 'SCANDINAVIAN REDS RIBBONS', 2, '2011-12-09 12:20:00', 1.25, 12748.0, 'United Kingdom'), (406774, '581580', '22075', '6 RIBBONS ELEGANT CHRISTMAS ', 2, '2011-12-09 12:20:00', 0.39, 12748.0, 'United Kingdom'), (406775, '581580', '21351', 'CINAMMON & ORANGE WREATH', 1, '2011-12-09 12:20:00', 6.75, 12748.0, 'United Kingdom'), (406776, '581580', '22698', 'PINK REGENCY TEACUP AND SAUCER', 1, '2011-12-09 12:20:00', 2.95, 12748.0, 'United Kingdom'), (406777, '581580', '22567', '20 DOLLY PEGS RETROSPOT', 1, '2011-12-09 12:20:00', 1.45, 12748.0, 'United Kingdom'), (406778, '581580', '79321', 'CHILLI LIGHTS', 2, '2011-12-09 12:20:00', 5.75, 12748.0, 'United Kingdom'), (406779, '581580', '37500', 'TEA TIME TEAPOT IN GIFT BOX', 1, '2011-12-09 12:20:00', 4.95, 12748.0, 'United Kingdom'), (406780, '581581', '23562', 'SET OF 6 RIBBONS PERFECTLY PRETTY  ', 6, '2011-12-09 12:20:00', 2.89, 17581.0, 'United Kingdom'), (406781, '581581', '23561', 'SET OF 6 RIBBONS PARTY', 6, '2011-12-09 12:20:00', 2.89, 17581.0, 'United Kingdom'), (406782, '581581', '23681', 'LUNCH BAG RED VINTAGE DOILY', 10, '2011-12-09 12:20:00', 1.65, 17581.0, 'United Kingdom'), (406783, '581582', '23552', 'BICYCLE PUNCTURE REPAIR KIT ', 6, '2011-12-09 12:21:00', 2.08, 17581.0, 'United Kingdom'), (406784, '581582', '23498', 'CLASSIC BICYCLE CLIPS ', 12, '2011-12-09 12:21:00', 1.45, 17581.0, 'United Kingdom'), (406785, '581583', '20725', 'LUNCH BAG RED RETROSPOT', 40, '2011-12-09 12:23:00', 1.45, 13777.0, 'United Kingdom'), (406786, '581583', '85038', '6 CHOCOLATE LOVE HEART T-LIGHTS', 36, '2011-12-09 12:23:00', 1.85, 13777.0, 'United Kingdom'), (406787, '581584', '20832', 'RED FLOCK LOVE HEART PHOTO FRAME', 72, '2011-12-09 12:25:00', 0.72, 13777.0, 'United Kingdom'), (406788, '581584', '85038', '6 CHOCOLATE LOVE HEART T-LIGHTS', 48, '2011-12-09 12:25:00', 1.85, 13777.0, 'United Kingdom'), (406789, '581585', '22481', 'BLACK TEA TOWEL CLASSIC DESIGN', 12, '2011-12-09 12:31:00', 0.39, 15804.0, 'United Kingdom'), (406790, '581585', '22915', 'ASSORTED BOTTLE TOP  MAGNETS ', 24, '2011-12-09 12:31:00', 0.19, 15804.0, 'United Kingdom'), (406791, '581585', '22178', 'VICTORIAN GLASS HANGING T-LIGHT', 12, '2011-12-09 12:31:00', 1.95, 15804.0, 'United Kingdom'), (406792, '581585', '22460', 'EMBOSSED GLASS TEALIGHT HOLDER', 12, '2011-12-09 12:31:00', 1.25, 15804.0, 'United Kingdom'), (406793, '581585', '84832', 'ZINC WILLIE WINKIE  CANDLE STICK', 24, '2011-12-09 12:31:00', 0.85, 15804.0, 'United Kingdom'), (406794, '581585', '23084', 'RABBIT NIGHT LIGHT', 12, '2011-12-09 12:31:00', 2.08, 15804.0, 'United Kingdom'), (406795, '581585', '84879', 'ASSORTED COLOUR BIRD ORNAMENT', 16, '2011-12-09 12:31:00', 1.69, 15804.0, 'United Kingdom'), (406796, '581585', '84945', 'MULTI COLOUR SILVER T-LIGHT HOLDER', 24, '2011-12-09 12:31:00', 0.85, 15804.0, 'United Kingdom'), (406797, '581585', '22113', 'GREY HEART HOT WATER BOTTLE', 4, '2011-12-09 12:31:00', 4.25, 15804.0, 'United Kingdom'), (406798, '581585', '23356', 'LOVE HOT WATER BOTTLE', 3, '2011-12-09 12:31:00', 5.95, 15804.0, 'United Kingdom'), (406799, '581585', '22726', 'ALARM CLOCK BAKELIKE GREEN', 8, '2011-12-09 12:31:00', 3.75, 15804.0, 'United Kingdom'), (406800, '581585', '22727', 'ALARM CLOCK BAKELIKE RED ', 4, '2011-12-09 12:31:00', 3.75, 15804.0, 'United Kingdom'), (406801, '581585', '16016', 'LARGE CHINESE STYLE SCISSOR', 10, '2011-12-09 12:31:00', 0.85, 15804.0, 'United Kingdom'), (406802, '581585', '21916', 'SET 12 RETRO WHITE CHALK STICKS', 24, '2011-12-09 12:31:00', 0.42, 15804.0, 'United Kingdom'), (406803, '581585', '84692', 'BOX OF 24 COCKTAIL PARASOLS', 25, '2011-12-09 12:31:00', 0.42, 15804.0, 'United Kingdom'), (406804, '581585', '84946', 'ANTIQUE SILVER T-LIGHT GLASS', 12, '2011-12-09 12:31:00', 1.25, 15804.0, 'United Kingdom'), (406805, '581585', '21684', 'SMALL MEDINA STAMPED METAL BOWL ', 12, '2011-12-09 12:31:00', 0.85, 15804.0, 'United Kingdom'), (406806, '581585', '22398', 'MAGNETS PACK OF 4 SWALLOWS', 12, '2011-12-09 12:31:00', 0.39, 15804.0, 'United Kingdom'), (406807, '581585', '23328', 'SET 6 SCHOOL MILK BOTTLES IN CRATE', 4, '2011-12-09 12:31:00', 3.75, 15804.0, 'United Kingdom'), (406808, '581585', '23145', 'ZINC T-LIGHT HOLDER STAR LARGE', 12, '2011-12-09 12:31:00', 0.95, 15804.0, 'United Kingdom'), (406809, '581585', '22466', 'FAIRY TALE COTTAGE NIGHT LIGHT', 12, '2011-12-09 12:31:00', 1.95, 15804.0, 'United Kingdom'), (406810, '581586', '22061', 'LARGE CAKE STAND  HANGING STRAWBERY', 8, '2011-12-09 12:49:00', 2.95, 13113.0, 'United Kingdom'), (406811, '581586', '23275', 'SET OF 3 HANGING OWLS OLLIE BEAK', 24, '2011-12-09 12:49:00', 1.25, 13113.0, 'United Kingdom'), (406812, '581586', '21217', 'RED RETROSPOT ROUND CAKE TINS', 24, '2011-12-09 12:49:00', 8.95, 13113.0, 'United Kingdom'), (406813, '581586', '20685', 'DOORMAT RED RETROSPOT', 10, '2011-12-09 12:49:00', 7.08, 13113.0, 'United Kingdom'), (406814, '581587', '22631', 'CIRCUS PARADE LUNCH BOX ', 12, '2011-12-09 12:50:00', 1.95, 12680.0, 'France'), (406815, '581587', '22556', 'PLASTERS IN TIN CIRCUS PARADE ', 12, '2011-12-09 12:50:00', 1.65, 12680.0, 'France'), (406816, '581587', '22555', 'PLASTERS IN TIN STRONGMAN', 12, '2011-12-09 12:50:00', 1.65, 12680.0, 'France'), (406817, '581587', '22728', 'ALARM CLOCK BAKELIKE PINK', 4, '2011-12-09 12:50:00', 3.75, 12680.0, 'France'), (406818, '581587', '22727', 'ALARM CLOCK BAKELIKE RED ', 4, '2011-12-09 12:50:00', 3.75, 12680.0, 'France'), (406819, '581587', '22726', 'ALARM CLOCK BAKELIKE GREEN', 4, '2011-12-09 12:50:00', 3.75, 12680.0, 'France'), (406820, '581587', '22730', 'ALARM CLOCK BAKELIKE IVORY', 4, '2011-12-09 12:50:00', 3.75, 12680.0, 'France'), (406821, '581587', '22367', 'CHILDRENS APRON SPACEBOY DESIGN', 8, '2011-12-09 12:50:00', 1.95, 12680.0, 'France'), (406822, '581587', '22629', 'SPACEBOY LUNCH BOX ', 12, '2011-12-09 12:50:00', 1.95, 12680.0, 'France'), (406823, '581587', '23256', 'CHILDRENS CUTLERY SPACEBOY ', 4, '2011-12-09 12:50:00', 4.15, 12680.0, 'France'), (406824, '581587', '22613', 'PACK OF 20 SPACEBOY NAPKINS', 12, '2011-12-09 12:50:00', 0.85, 12680.0, 'France'), (406825, '581587', '22899', "CHILDREN'S APRON DOLLY GIRL ", 6, '2011-12-09 12:50:00', 2.1, 12680.0, 'France'), (406826, '581587', '23254', 'CHILDRENS CUTLERY DOLLY GIRL ', 4, '2011-12-09 12:50:00', 4.15, 12680.0, 'France'), (406827, '581587', '23255', 'CHILDRENS CUTLERY CIRCUS PARADE', 4, '2011-12-09 12:50:00', 4.15, 12680.0, 'France'), (406828, '581587', '22138', 'BAKING SET 9 PIECE RETROSPOT ', 3, '2011-12-09 12:50:00', 4.95, 12680.0, 'France')]

## Customer_data

In [19]:
dbase.execute('''create table if not exists customer_data(
c_id integer primary key,
c_name  TEXT NOT_NULL,
c_ph_no TEXT,
c_login_id TEXT,
c_password TEXT
) ''')

In [20]:
#inserting values
l = [ ('aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'),('karan', '1234567890', 'karan@gmail.com', 'kiru1298'), ('Rohan', '9876543210', 'rohan@gmail.com', 'rohan123') ]
insert_record('customer_data',l)

[('aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'), ('karan', '1234567890', 'karan@gmail.com', 'kiru1298'), ('Rohan', '9876543210', 'rohan@gmail.com', 'rohan123')]

In [21]:
# cur = dbase.cursor()
cur.execute('''select * from customer_data''')
print(cur)
print(cur.fetchall())

<sqlite3.Cursor object at 0x7f445ba9db20>
[(1, 'aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'), (2, 'karan', '1234567890', 'karan@gmail.com', 'kiru1298'), (3, 'Rohan', '9876543210', 'rohan@gmail.com', 'rohan123')]

## SALES DATA TO DB

In [15]:
sales_data = pd.read_csv('../../Apriori/date_price_sales.csv')

In [16]:
sales_data.to_sql('sales_1', dbase, if_exists='append', index=False)

## SHOW ALL TABLES

In [17]:
cursor = dbase.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('transactions_1',), ('sales_1',)]

In [17]:
dbase.close()

## Creating shop_info

In [143]:
data = pd.read_csv('onlineretail_clean.csv')
data2 = pd.read_csv('onlineretail2_clean.csv')

In [144]:
data.head()
data2.head()

,Unnamed: 0,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [145]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406829 entries, 0 to 406828
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Unnamed: 0   406829 non-null  int64
 1   Invoice      406829 non-null  object
 2   StockCode    406829 non-null  object
 3   Description  406829 non-null  object
 4   Quantity     406829 non-null  int64
 5   InvoiceDate  406829 non-null  object
 6   Price        406829 non-null  float64
 7   Customer ID  406829 non-null  float64
 8   Country      406829 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 27.9+ MB

In [129]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 824348 entries, 0 to 824347
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      824348 non-null  object
 1   StockCode    824348 non-null  object
 2   Description  824348 non-null  object
 3   Quantity     824348 non-null  int64
 4   InvoiceDate  824348 non-null  datetime64[ns]
 5   Price        824348 non-null  float64
 6   Customer ID  824348 non-null  float64
 7   Country      824348 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 50.3+ MB

In [130]:
data.dropna(inplace=True)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 406829 entries, 0 to 406828
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      406829 non-null  object
 1   StockCode    406829 non-null  object
 2   Description  406829 non-null  object
 3   Quantity     406829 non-null  int64
 4   InvoiceDate  406829 non-null  datetime64[ns]
 5   Price        406829 non-null  float64
 6   Customer ID  406829 non-null  float64
 7   Country      406829 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 27.9+ MB

In [131]:
len(data['StockCode'].unique())

3684

In [132]:
len(data['Description'].unique())

3896

In [133]:
data.columns

Index(['Invoice', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'Price', 'Customer ID', 'Country'],
      dtype='object')

In [79]:
data.columns

Index(['Invoice', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'Price', 'Customer ID', 'Country'],
      dtype='object')

In [136]:
shop1 = data[['StockCode','Description','Price']]
shop2 = data2[['StockCode','Description','Price']]

In [137]:
shop1 = shop1.drop_duplicates(subset='StockCode')
shop2 = shop2.drop_duplicates(subset='StockCode')

In [138]:
shop1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3684 entries, 0 to 406349
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   StockCode    3684 non-null   object
 1   Description  3684 non-null   object
 2   Price        3684 non-null   float64
dtypes: float64(1), object(2)
memory usage: 115.1+ KB

In [139]:
shop2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4644 entries, 0 to 823867
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   StockCode    4644 non-null   object
 1   Description  4644 non-null   object
 2   Price        4644 non-null   float64
dtypes: float64(1), object(2)
memory usage: 305.1+ KB

In [83]:
len(shop)

4644

In [140]:
shop1['Quantity'] = 300
shop2['Quantity'] = 300

In [141]:
shop1.to_csv('../../database/store_1.csv',index=False)
shop2.to_csv('../../database/store_2.csv',index=False)

In [88]:
dbase.execute('''drop table store_1''')

In [142]:
shop1.to_sql('store_1', dbase, if_exists='append', index=False)
shop2.to_sql('store_2', dbase, if_exists='append', index=False)

In [20]:
import sqlite3
import time
import datetime
import random
import pandas as pd


df = pd.read_sql_query("SELECT * FROM customer_data", dbase)

# login_id = 'karn@gmail.com'
login_id = 'karan@gmail.com'
# password = 'kiru1298'
password = 'kiru128'
val = ''
val = df[df['c_login_id']==login_id]['c_password'][1]
print(type(val), len(val))
name = ""
if val == password: 
    name = df[df['c_password']==val]['c_name'][1]
    print('welcome',name)
else:
    print('wrong user name')
# else:
#     print('Wrong password')

<class 'str'> 8
wrong user name